### Data Cleaning and Preparation

In [5]:
import numpy as np
import pandas as pd
previous_max_rows = pd.options.display.max_rows
b=pd.options.display.max_rows = 20
a= np.random.seed(12345)

In [6]:
print(a)

None

In [7]:
print(b)

20

In [10]:
import matplotlib.pyplot as plt
plt.rc('figure',figsize=(10,6))
np.set_printoptions(precision=4,suppress= True)

In [12]:
# Handling Missing Data

In [13]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [14]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
# Filtering Misssingout data

In [16]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4]=NA
data
data.dropna(axis = 1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.457002       NaN -1.569271
3 -1.022487       NaN  0.220487
4 -0.193401  0.669158 -1.648985
5 -2.252797 -1.166832  0.353607
6  0.702110 -0.274569 -0.139142

In [30]:
# Filling in Missing Data

In [31]:
df.fillna(0)

          0         1         2
0 -0.036264  0.000000  0.000000
1 -0.589488  0.000000  0.000000
2  0.457002  0.000000 -1.569271
3 -1.022487  0.000000  0.220487
4 -0.193401  0.669158 -1.648985
5 -2.252797 -1.166832  0.353607
6  0.702110 -0.274569 -0.139142

In [34]:
df.fillna({1:0.5, 2:0.7})

          0         1         2
0 -0.036264  0.500000  0.700000
1 -0.589488  0.500000  0.700000
2  0.457002  0.500000 -1.569271
3 -1.022487  0.500000  0.220487
4 -0.193401  0.669158 -1.648985
5 -2.252797 -1.166832  0.353607
6  0.702110 -0.274569 -0.139142

In [35]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -0.036264  0.000000  0.000000
1 -0.589488  0.000000  0.000000
2  0.457002  0.000000 -1.569271
3 -1.022487  0.000000  0.220487
4 -0.193401  0.669158 -1.648985
5 -2.252797 -1.166832  0.353607
6  0.702110 -0.274569 -0.139142

In [40]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.296608  0.252275  1.127481
1 -0.568363  0.309362 -0.577385
2 -1.168634  0.309362 -2.644409
3 -0.152986  0.309362 -0.132609
4  1.457300       NaN -0.132609
5  1.239980       NaN -0.132609

In [44]:
data = pd.Series([1., NA, 3.5, NA, 7])
print(data)
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
#removing duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data['v1']=range(7)
print(data)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [54]:
#Transforming data using a lambda function

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [59]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [62]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [63]:
#Replacing Values inplace of missing values

In [64]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [71]:
a=data.replace([-999, -1000], [np.nan, 0])
a

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [70]:
a.replace({np.nan:-999, 0:-1000 })

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [72]:
#renaming Axis indexes

In [73]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [75]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [78]:
transform = lambda x: x[:4].upper()
#transform
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [79]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [82]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [85]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [87]:
bins = [18, 25, 35, 60, 100]
bins

[18, 25, 35, 60, 100]

In [88]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [96]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [99]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [100]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [101]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.49, 0.73], (0.019, 0.26], (0.26, 0.49], (0.73, 0.96], (0.73, 0.96], ..., (0.49, 0.73], (0.49, 0.73], (0.73, 0.96], (0.73, 0.96], (0.019, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.019, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

In [103]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats
pd.value_counts(cats)

(0.705, 3.26]       250
(0.0293, 0.705]     250
(-0.595, 0.0293]    250
(-3.746, -0.595]    250
dtype: int64

In [104]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.31, 0.0293], (0.0293, 1.323], (-1.31, 0.0293], (-1.31, 0.0293], (-1.31, 0.0293], ..., (-1.31, 0.0293], (1.323, 3.26], (0.0293, 1.323], (1.323, 3.26], (0.0293, 1.323]]
Length: 1000
Categories (4, interval[float64]): [(-3.746, -1.31] < (-1.31, 0.0293] < (0.0293, 1.323] < (1.323, 3.26]]

In [107]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
data[2]

0      1.294249
1     -2.304227
2     -0.865904
3      2.045428
4      1.048618
         ...
995    1.235567
996   -1.511111
997   -1.090086
998    0.126623
999    0.323662
Name: 2, Length: 1000, dtype: float64

In [108]:
col = data[2]
col[np.abs(col) > 3]

624    3.003284
Name: 2, dtype: float64

In [109]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
154  1.052036  1.490529 -0.928871  3.061029
230  0.622791  3.144389  0.391328  0.672451
495  0.172595 -0.923066 -1.554274  3.897527
514  3.160760 -0.718885 -1.716556  0.674845
523 -1.567338  0.706299  2.133070  3.048747
624 -0.334487 -1.361069  3.003284  2.151570
723 -3.398085 -0.349365  1.440938  0.074944
772  3.484365 -0.593819 -0.026805  0.702526
810  3.521136  1.337858  1.431504  0.094059
837  0.143912 -1.916714  0.799651 -3.255825

In [110]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011714    -0.005025     0.003622    -0.006051
std       0.958518     1.028005     0.992079     1.007672
min      -3.000000    -2.999799    -2.938085    -3.000000
25%      -0.604443    -0.686750    -0.681739    -0.672428
50%       0.045696     0.016320     0.024932     0.047835
75%       0.658735     0.670908     0.674899     0.692505
max       3.000000     3.000000     3.000000     3.000000

In [111]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [112]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [127]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c','d', 'd'],[1, 2, 3, 1, 3, 1, 2,2, 3]])
data

a  1   -0.589488
   2    1.581700
   3   -0.528735
b  1    0.457002
   3    0.929969
c  1   -1.569271
   2   -1.022487
d  2   -0.402827
   3    0.220487
dtype: float64

In [128]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [129]:
data['b']
data['b':'c']
data.loc[['b', 'd']]

b  1    0.457002
   3    0.929969
d  2   -0.402827
   3    0.220487
dtype: float64

In [130]:
data.loc[:, 2]

a    1.581700
c   -1.022487
d   -0.402827
dtype: float64

In [131]:
data.unstack()

          1         2         3
a -0.589488  1.581700 -0.528735
b  0.457002       NaN  0.929969
c -1.569271 -1.022487       NaN
d       NaN -0.402827  0.220487

In [132]:
data.unstack().stack()

a  1   -0.589488
   2    1.581700
   3   -0.528735
b  1    0.457002
   3    0.929969
c  1   -1.569271
   2   -1.022487
d  2   -0.402827
   3    0.220487
dtype: float64

In [133]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [134]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [135]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [136]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [137]:
frame.sort_index(level=1)
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11